In [25]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LogisticRegression
train = pd.read_csv("training_titanic_x_y_train.csv")

In [26]:
def f(s):
    if s == "female":
        return 1
    else:
        return 0
train["Gender"] = train.Sex.apply(f)
del train["Sex"]

In [27]:
train.head()

,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,Gender
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",29.0,1,0,228414,26.000,NaN,S,1,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",NaN,0,0,A/5 2466,8.050,NaN,S,0,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",39.0,0,0,250655,26.000,NaN,S,0,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",29.0,0,4,349909,21.075,NaN,S,0,1
4,3,"Sutehall, Mr. Henry Jr",25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0,0

In [28]:
def missing_age(s):
    if pd.isnull(s):
        return 1
    else:
        return 0
train["Missing_Age"] = train.Age.apply(missing_age)

In [29]:
train.head()

,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,Gender,Missing_Age
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",29.0,1,0,228414,26.000,NaN,S,1,1,0
1,3,"Williams, Mr. Howard Hugh ""Harry""",NaN,0,0,A/5 2466,8.050,NaN,S,0,0,1
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",39.0,0,0,250655,26.000,NaN,S,0,0,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",29.0,0,4,349909,21.075,NaN,S,0,1,0
4,3,"Sutehall, Mr. Henry Jr",25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0,0,0

In [30]:
#train.Age.fillna(train.Age.mean(), inplace = True

In [31]:
Survived1_mean = train[train.Survived == 1].Age.mean()
Survived0_mean = train[train.Survived == 0].Age.mean()
for a in train[train.Survived == 1]:
    train.Age.fillna(Survived1_mean, inplace = True)
for i in train[train.Survived == 0]:
    train.Age.fillna(Survived0_mean, inplace = True)

In [32]:
train.head()

,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,Gender,Missing_Age
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",29.000000,1,0,228414,26.000,NaN,S,1,1,0
1,3,"Williams, Mr. Howard Hugh ""Harry""",28.138158,0,0,A/5 2466,8.050,NaN,S,0,0,1
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",39.000000,0,0,250655,26.000,NaN,S,0,0,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",29.000000,0,4,349909,21.075,NaN,S,0,1,0
4,3,"Sutehall, Mr. Henry Jr",25.000000,0,0,SOTON/OQ 392076,7.050,NaN,S,0,0,0

In [33]:
train.describe()

,Pclass,Age,SibSp,Parch,Fare,Survived,Gender,Missing_Age
count,668.000000,668.000000,668.000000,668.000000,668.000000,668.000000,668.000000,668.000000
mean,2.296407,29.391822,0.528443,0.407186,32.064552,0.402695,0.360778,0.197605
std,0.831638,12.768759,1.080327,0.854695,45.320835,0.490808,0.480586,0.398491
min,1.000000,0.670000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2.000000,23.000000,0.000000,0.000000,7.925000,0.000000,0.000000,0.000000
50%,3.000000,28.138158,0.000000,0.000000,14.750000,0.000000,0.000000,0.000000
75%,3.000000,35.000000,1.000000,0.000000,31.275000,1.000000,1.000000,0.000000
max,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000,1.000000,1.000000

In [34]:
train.columns

Index(['Pclass', 'Name', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin',
       'Embarked', 'Survived', 'Gender', 'Missing_Age'],
      dtype='object')

In [35]:
train_df1 = train.iloc[:,[0,2,3,4,6,10,11]].values

In [36]:
y_train = train.iloc[:, 9].values

In [37]:
test = pd.read_csv("test_titanic_x_test.csv")

In [38]:
test["Missing_Age"] = test.Age.apply(missing_age)

In [39]:
test.Age.fillna(train.Age.mean(), inplace = True)
test.describe()

           Pclass         Age       SibSp       Parch        Fare  Missing_Age
count  223.000000  223.000000  223.000000  223.000000  223.000000   223.000000
mean     2.345291   29.633641    0.506726    0.304933   32.622551     0.201794
std      0.850047   13.749693    1.169700    0.634108   61.062047     0.402242
min      1.000000    0.420000    0.000000    0.000000    0.000000     0.000000
25%      2.000000   22.000000    0.000000    0.000000    7.879200     0.000000
50%      3.000000   29.391822    0.000000    0.000000   12.475000     0.000000
75%      3.000000   35.000000    1.000000    0.000000   30.035400     0.000000
max      3.000000   71.000000    8.000000    2.000000  512.329200     1.000000

In [40]:
test["Gender"] = test.Sex.apply(f)
del test["Sex"]

In [41]:
test.columns

Index(['Pclass', 'Name', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin',
       'Embarked', 'Missing_Age', 'Gender'],
      dtype='object')

In [42]:
x_test = test.iloc[:,[0,2,3,4,6,10,9]].values

In [43]:
clf1 = LogisticRegression(C = 2.745)

In [44]:
clf1.fit(train_df1, y_train)

LogisticRegression(C=2.745, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [45]:
test_pred = clf1.predict(x_test)

In [46]:
clf1.score(train_df1, y_train)

0.79640718562874246

In [48]:
import numpy as np
np.savetxt('y_pred.csv',test_pred )